testing/ellipse2d_of/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}

application     foamRun;
solver          incompressibleFluid;

startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         5000;
deltaT          1;

writeControl    timeStep;
writeInterval   100;

runTimeModifiable yes;
