testing/ellipse2d_of/constant/transportProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}

viscosityModel  constant;
nu              1.5e-5;
