testing/ellipse2d_of/0/p
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}

dimensions  [0 2 -2 0 0 0 0];
internalField uniform 0;

boundaryField
{
    inlet       { type zeroGradient; }
    outlet      { type fixedValue; value uniform 0; }
    top         { type zeroGradient; }
    body        { type zeroGradient; }
    wedge_front { type wedge; }
    wedge_back  { type wedge; }
    axis        { type empty; }
}
