testing/ellipse2d_of/0/k
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}

dimensions  [0 2 -2 0 0 0 0];
internalField uniform 0.2962;

boundaryField
{
    inlet       { type fixedValue; value uniform 0.2962; }
    outlet      { type zeroGradient; }
    top         { type zeroGradient; }
    body        { type kqRWallFunction; value uniform 0; }
    wedge_front { type wedge; }
    wedge_back  { type wedge; }
    axis        { type empty; }
}
